# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре.
# Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
# Необходимо использовать написанную ранее функцию int_func().

def first_uppercase(word):
    return word[0].upper() + word[1:] if len(word) > 0 else ''


if __name__ == '__main__':
    line = input("Enter long string separated by spaces: ")
    print(' '.join(map(first_uppercase, line.split(' '))))
